In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.3.3'

In [3]:
pd.__doc__

'\npandas - a powerful data analysis and manipulation library for Python\n=====================================================================\n\n**pandas** is a Python package providing fast, flexible, and expressive data\nstructures designed to make working with "relational" or "labeled" data both\neasy and intuitive. It aims to be the fundamental high-level building block for\ndoing practical, **real world** data analysis in Python. Additionally, it has\nthe broader goal of becoming **the most powerful and flexible open source data\nanalysis / manipulation tool available in any language**. It is already well on\nits way toward this goal.\n\nMain Features\n-------------\nHere are just a few of the things that pandas does well:\n\n  - Easy handling of missing data in floating point as well as non-floating\n    point data.\n  - Size mutability: columns can be inserted and deleted from DataFrame and\n    higher dimensional objects\n  - Automatic and explicit data alignment: objects can be explicitly aligned\n    to a set of labels, or the user can simply ignore the labels and let\n    `Series`, `DataFrame`, etc. automatically align the data for you in\n    computations.\n  - Powerful, flexible group by functionality to perform split-apply-combine\n    operations on data sets, for both aggregating and transforming data.\n  - Make it easy to convert ragged, differently-indexed data in other Python\n    and NumPy data structures into DataFrame objects.\n  - Intelligent label-based slicing, fancy indexing, and subsetting of large\n    data sets.\n  - Intuitive merging and joining data sets.\n  - Flexible reshaping and pivoting of data sets.\n  - Hierarchical labeling of axes (possible to have multiple labels per tick).\n  - Robust IO tools for loading data from flat files (CSV and delimited),\n    Excel files, databases, and saving/loading data from the ultrafast HDF5\n    format.\n  - Time series-specific functionality: date range generation and frequency\n    conversion, moving window statistics, date shifting and lagging.\n'

In [4]:
print(pd.__doc__)

pandas - a powerful data analysis and manipulation library for Python
=====================================================================

**pandas** is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. It aims to be the fundamental high-level building block for
doing practical, **real world** data analysis in Python. Additionally, it has
the broader goal of becoming **the most powerful and flexible open source data
analysis / manipulation tool available in any language**. It is already well on
its way toward this goal.

Main Features
-------------
Here are just a few of the things that pandas does well:

  - Easy handling of missing data in floating point as well as non-floating
    point data.
  - Size mutability: columns can be inserted and deleted from DataFrame and
    higher dimensional objects
  - Automatic and explicit data alignment: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  - Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets, for both aggregating and transforming data.
  - Make it easy to convert ragged, differently-indexed data in other Python
    and NumPy data structures into DataFrame objects.
  - Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.
  - Intuitive merging and joining data sets.
  - Flexible reshaping and pivoting of data sets.
  - Hierarchical labeling of axes (possible to have multiple labels per tick).
  - Robust IO tools for loading data from flat files (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.
  - Time series-specific functionality: date range generation and frequency
    conversion, moving window statistics, date shifting and lagging.

# Pandas lucreaza cu Serii si DataFrame-uri

In [5]:
lista = [1, 2, 3, 4]

pd.Series(lista)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
lista = [12, 23, 34, 45]

pd.Series(lista)

0    12
1    23
2    34
3    45
dtype: int64

In [8]:
lista = [12, 23, 34, 45]

serie = pd.Series(lista)
serie, type(serie), serie.dtype

(0    12
 1    23
 2    34
 3    45
 dtype: int64,
 pandas.core.series.Series,
 dtype('int64'))

In [9]:
lista = [12, 23, 34, 45]

serie = pd.Series(lista)
print(serie)

0    12
1    23
2    34
3    45
dtype: int64

In [10]:
serie[2]

np.int64(34)

In [11]:
serie[1:3]

1    23
2    34
dtype: int64

In [12]:
serie[1:3] = 999

In [13]:
serie

0     12
1    999
2    999
3     45
dtype: int64

In [15]:
lista = [12, 344, 32, 324, 532]

df = pd.DataFrame(lista)
df

     0
0   12
1  344
2   32
3  324
4  532

In [16]:
lista = [[12, 344, 32, 324, 532], [12, 344, 32, 324, 532]]

df = pd.DataFrame(lista)
df

    0    1   2    3    4
0  12  344  32  324  532
1  12  344  32  324  532

In [17]:
lista = { "colA": [12, 344, 32, 324, 532], "colB": [12, 344, 32, 324, 532]}

df = pd.DataFrame(lista)
df

   colA  colB
0    12    12
1   344   344
2    32    32
3   324   324
4   532   532

In [19]:
df = pd.DataFrame({
    "culori" :["rosu", "verde", "albastru"]
})
df

     culori
0      rosu
1     verde
2  albastru

In [20]:
df = pd.DataFrame({
    "culori" :["rosu", "verde", "albastru"],
    "temperaturi" : [10, 20, 30]
})
df

     culori  temperaturi
0      rosu           10
1     verde           20
2  albastru           30

In [23]:
df = pd.DataFrame({
    "culori" :["rosu", "verde", "albastru", None],
    "temperaturi" : [10, 20, 30, 40]
})
df

     culori  temperaturi
0      rosu           10
1     verde           20
2  albastru           30
3      None           40

In [26]:
rezultat = df["culori"]
rezultat, type(rezultat)

(0        rosu
 1       verde
 2    albastru
 3        None
 Name: culori, dtype: object,
 pandas.core.series.Series)

In [27]:
rezultat = df [      ["culori"]    ]
rezultat, type(rezultat)

(     culori
 0      rosu
 1     verde
 2  albastru
 3      None,
 pandas.core.frame.DataFrame)

In [28]:
df

     culori  temperaturi
0      rosu           10
1     verde           20
2  albastru           30
3      None           40

In [30]:
df.to_numpy()

array([['rosu', 10],
       ['verde', 20],
       ['albastru', 30],
       [None, 40]], dtype=object)

In [31]:
df.to_csv("culori_temperaturi.csv")

In [32]:
df.to_json("culori_temperaturi.json")

In [35]:
pd.read_csv("culori_temperaturi.csv")

   Unnamed: 0    culori  temperaturi
0           0      rosu           10
1           1     verde           20
2           2  albastru           30
3           3       NaN           40

In [37]:
file_df = pd.read_csv("culori_temperaturi.csv", index_col=0)
file_df

     culori  temperaturi
0      rosu           10
1     verde           20
2  albastru           30
3       NaN           40

In [38]:
file_df.count()

culori         3
temperaturi    4
dtype: int64